Tekla.Structures.DrawingInternal.TSDrawingColorHandler.BidirectionalDictionary`2
A bidirectional dictionary that allows for looking up keys by values and values by keys.
The key type.
The value type.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.BidirectionalDictionary`2.Add(`0,`1)
Adds the specified key and value to the bidirectional dictionary.
key: The key of the element to add.
value: The value of the element to add

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.BidirectionalDictionary`2.TryGetKey(`1,`0@)
Gets the key associated with the specified value.
value: When this method returns, contains the key associated with the specified value,
if the value is found; otherwise, the default value for the type of the key parameter.
This parameter is passed uninitialized.
key: The key of the value to get.
Returns: true if the System.Collections.Generic.Dictionary`2 contains an element with the specified key; otherwise, false.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.BidirectionalDictionary`2.TryGetValue(`0,`1@)
Gets the value associated with the specified key.
key: The key of the value to get.
value: When this method returns, contains the value associated with the specified key,
if the key is found; otherwise, the default value for the type of the value parameter.
This parameter is passed uninitialized.
Returns: The value associated with the specified key.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.BidirectionalDictionary`2.GetValues
Create a list containing the values of the bidirectional dictionary.
Returns: The list of value of the bidirectional dictionary.

Tekla.Structures.DrawingInternal.TSDrawingColorHandler.BidirectionalDictionary`2.GetKeys
Create a list containing the values of the bidirectional dictionary.
Returns: The list of value of the bidirectional dictionary.